#Область ПрограммныйИнтерфейс
	Процедура ПриСозданииНаСервере(Форма) Экспорт 
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноЛицоВГруппаШапкаПраво(Форма);
		ДобавитьПолеКомандуСкидка(Форма)
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноЛицоВГруппаШапкаПраво(Форма);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПрограммныйИнтерфейс
Процедура ДобавитьПолеКонтактноЛицоВГруппаШапкаПраво(Знач Форма)
	
	Перем ПолеВвода;
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	Полеввода.ПутьКДанным = "Объект.КЛ_КонтакноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьПолеКомандуСкидка(Форма)

	
	Группа = Форма.Элементы.Добавить("ГруппаДобавленныхСвойств", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	Группа.Заголовок = "Добавленные Свойства";
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	// добовление Поля ввода на форму
	ПолеВвода = Форма.Элементы.Добавить("Скидка", Тип("ПолеФормы"), Группа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	Полеввода.ПутьКДанным = "Объект.КЛ_Скидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "СкидкаПриИзменении");
	
	// добовление команды на форму
	Команда = Форма.Команды.Добавить("КомандаСкидка");
	Команда.Заголовок = "Скидка";
	Команда.Действие = "СкидкаНажатие";
	//
	Кнопка = Форма.Элементы.Добавить("КнопкаСкидка", тип("КнопкаФормы"), Группа);
	Кнопка.ИмяКоманды = "КомандаСкидка";
	Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
КонецПроцедуры


#КонецОбласти
